#+OPTIONS: toc:nil -:nil H:6 ^:nil
#+EXCLUDE_TAGS: noexport
#+STARTUP: overview
#+BEGIN_EXAMPLE
---
title: "JavaScript"
layout: notation
description:
path: "/javascript/"
---
#+END_EXAMPLE

*** Objects

#+BEGIN_SRC js :cmd "org-babel-node"
  let structured = {
    title: 'structured title',
    description: 'structured desc'
  }

  const { title, description } = structured;

  console.log(title);
  console.log(description);
#+END_SRC

#+RESULTS:
: structured title
: structured desc
: undefined


#+BEGIN_SRC js :cmd "org-babel-node --presets=stage-2"
let obj1 = {
  bird: "falcon2",
  frog: "bullfrog"
}
let { bird, frog: frogName } = obj1;
console.log(bird);
console.log(frogName);

let obj2 = {
  fruit: "apple",
  veggie: "kale",
  meat: "tofuball"
}
let { fruit, ...restItem } = obj2;
console.log(fruit);
console.log(restItem);
#+END_SRC

*** Identity

#+BEGIN_SRC js
function _isPlaceholder(a) {
  return a != null && typeof a === 'object' && a['@@functional/placeholder'] === true;
}

function _identity(x) {
  return x;
}

function _curry1(fn) {
  return function f1(a) {
    if (arguments.length === 0 || _isPlaceholder(a)) {
      return f1;
    } else {
      return fn.apply(this, arguments);
    }
  };
}

var identity = _curry1(_identity);

const val = 5;
const iVal = identity(val);
console.log('iVal', iVal);
#+END_SRC

#+RESULTS:
: iVal 5
: undefined

** set org-babel-node command                                      :noexport:

 #+BEGIN_SRC js :cmd "org-babel-node"
let props = {
  object: {},
  string: '',
  array: []
}
console.log(props);
 #+END_SRC

 #+RESULTS:
 : { postData: { title: 'pd-title', description: 'pd-desc', path: 'pd-path' },
 :   title: 'reg-title',
 :   description: 'reg-desc',
 :   path: 'reg-path' }
 : undefined


 #+BEGIN_SRC js :cmd "org-babel-node --presets=es2015"
  const animals = ['dog', 'cat']

  animals.map((anim) => {
    console.log('anim', anim);
  })
 #+END_SRC

 #+RESULTS:
 : anim dog
 : anim cat
 : undefined
